trade_exp/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ДоговорыКонтрагентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>НаименованиеДляПечати</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СуммаПрибыли</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаНачалаДействия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПорядокРасчетов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДопустимаяСуммаЗадолженности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>БанковскийСчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Дата</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПлатежиПо275ФЗ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВалютаВзаиморасчетов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОграничиватьСуммуЗадолженности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидАгентскогоДоговора</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГруппаФинансовогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИдентификаторПлатежа</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИностранныйИсполнительВУтвержденномПеречнеГОЗ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТипПлатежаФЗ275</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>УчетАгентскогоНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЗапрещаетсяПросроченнаяЗадолженность</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТипДоговора</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>БанковскийСчетКонтрагента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Номер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВходящийНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>КоличествоДнейПросрочки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СтатусДоговора</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>РазрешитьОтгрузкуПриПревышении</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТекстДляНазначенияПлатежа</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="1e4d6429-3779-415e-a0fd-605e54b909fe">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e2ff70d3-ff88-44af-b741-32d672c8125a">
    <name>ПечататьВУПД</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e06bae83-ba77-48c9-bb40-159b45c72ed6">
    <name>ОплатаВВалюте</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a0241b3d-6845-4ee6-8b92-3b00a0b4c45c">
    <name>Согласован</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ec175e6e-8a0f-46c1-8f61-1933ed068350">
    <name>ДоговорСУчастникомГОЗ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d4de0c91-22dd-4ce4-bc98-884061653165">
    <name>ГосударственныйКонтракт</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="dd40c379-db06-454d-a768-f757b503f620">
    <name>РазрешенаРаботаСДочернимиПартнерами</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="757d135e-2285-42a9-8208-52f29d49e69e">
    <name>ИдентификаторГосКонтракта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="8ab3f66d-3919-4794-9cb9-5d1357469cd5">
    <name>КомиссионныеПродажи25</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3cce95d9-af7e-4260-8c94-acb4b858ce14">
    <name>НалогообложениеНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4260e299-3a49-43df-b15c-e023f1cec2d5">
    <name>СтавкаНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="79844f87-ebb9-4536-bbae-5da8b7904167">
    <name>ВариантВыбытияМаркируемойПродукции</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>ПодтверждающиеДокументы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ВидДокумента</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>10</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Номер</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>128</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Дата</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Файл</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="df10b069-e208-42fb-b04f-d5b5239f320e">
    <name>ДополнительныеРеквизиты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="92a07f04-3acc-4b83-9d37-ef44ee4db151">
      <name>Свойство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="cb23b7af-c779-4ad4-99e8-4abfff8b406c">
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="90605e38-9973-4892-8b74-198167fdf900">
      <name>ТекстоваяСтрока</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="73afeb44-37a7-425d-8755-c69ab50eb0b4">
    <name>Филиалы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="9950309a-c137-45a6-98c6-a27d9b40522b">
      <name>Организация</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade_exp/src/InformationRegisters/ЛимитыДоговоров/ЛимитыДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="94202788-354d-4302-af57-8056e962cbd2">
  <name>ЛимитыДоговоров</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="d157fce7-ad3e-492d-9534-f25cb76a5af7">
    <name>СуммаЛимита</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="5fbff804-958b-4a5f-900d-b83d348fa40c">
    <name>КоличествоДнейОтсрочки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="abc05dce-0b75-43cf-8f35-d7efa819d1d1">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="f0132935-e901-4b5d-9ef9-7301216d9332">
    <name>ВариантВыбора</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0f9d4b04-969d-4a8a-aa25-f439557944e6">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e42b0c5b-bfc5-4c4c-800c-e36fb141c619">
    <name>Периодично</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="08282529-def8-476e-860f-395b38d08e44">
    <name>ПервоначальныеДанные</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1109fa6d-e859-464e-a823-410c4c1693b2">
    <name>ПредставлениеПериода</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <dimensions extendedConfigurationObject="e87ec4cf-e29a-4ec1-aaea-e46d7c521959">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="087563bf-9775-42fd-b545-e1e0945b9369">
    <name>ДатаНачала</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="29881099-61b3-4910-9353-ee4900415c4a">
    <name>ДатаОкончания</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Enums/СтатусыДоговоровКонтрагентов/СтатусыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтатусыДоговоровКонтрагентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Действует</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="3915309e-1c9c-447e-82d1-cd037c7784b2">
    <name>НеСогласован</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="26b5dc0e-bfd2-43c0-b272-c13aae125257">
    <name>Закрыт</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/ТипыДоговоров/ТипыДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыДоговоров</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="7167043e-3ed3-411a-a338-9e59ecb123f5">
    <name>СПокупателем</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="81324e26-995c-4379-af71-5ad2721ba02b">
    <name>СДавальцем2_5</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Catalogs/ДоговорыКонтрагентов/Forms/ФормаЭлемента/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ДатаДоИзменения;

&НаСервере
Перем СтарыйЧисловойНомер, СтараяДата;

#КонецОбласти // ОписаниеПеременных

#Область Методы_автонумерации

&НаСервере
Функция ПолучитьНовыйНомер(НомерЧислом)
	
	Если Объект.Дата = Дата('00010101000000') Тогда
		НомерЧислом = 0;
		Возврат "Укажите дату договора!";
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПериодНумерации = НачалоГода(Объект.Дата);
	СтруктураИзмерений = Новый Структура;
	СтруктураИзмерений.Вставить("ПериодНумерации", ПериодНумерации);
	ПоследнийНомер = РегистрыСведений.АвтоНумерацияДоговоровКонтрагента.Получить(СтруктураИзмерений).ТекущийНомер;
	Если Не ЗначениеЗаполнено(ПоследнийНомер) Тогда
		ПоследнийНомер = 0;
	КонецЕсли;
	
	НомерЧислом = Мин(ПоследнийНомер + 1, 99999);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат "";
	
КонецФункции

&НаСервере
Процедура УстановитьНомер(НомерЧислом, ИзменитьПризнакМодифицированности = Истина)
	
	Если НомерЧислом > 0 Тогда
		НомерТекстом = Формат(НомерЧислом, "ЧЦ=5; ЧВН=; ЧГ=0") + "/" + Формат(Объект.Дата, "ДФ=гг");
	Иначе
		НомерТекстом = "";
	КонецЕсли;
	
	Если НомерТекстом <> Объект.Номер Тогда
		Объект.Номер = НомерТекстом;
		Модифицированность = ИзменитьПризнакМодифицированности;
	КонецЕсли;
	Если НомерЧислом <> Объект.ЧисловойНомер Тогда
		Объект.ЧисловойНомер = НомерЧислом;
		Модифицированность = ИзменитьПризнакМодифицированности;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьАвтонумерации()

	ГиперссылкаКакЧисловойНомер	= Объект.ЧисловойНомер > 0;
	Если ГиперссылкаКакЧисловойНомер Тогда	
		Элементы.Автонумерация.Вид			= ВидДекорацииФормы.Надпись;
		Элементы.Автонумерация.Заголовок	= Объект.ЧисловойНомер;
	Иначе
		Элементы.Автонумерация.Вид							= ВидДекорацииФормы.Картинка;
		Элементы.Автонумерация.Картинка						= БиблиотекаКартинок.Настройка;
		Элементы.Автонумерация.РазмерКартинки				= РазмерКартинки.Пропорционально;
		Элементы.Автонумерация.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Центр;
	КонецЕсли;
	ДоговорНеЗакрыт						= Объект.Статус <> Перечисления.СтатусыДоговоровКонтрагентов.Закрыт;
	Элементы.Номер.Толькопросмотр		= ГиперссылкаКакЧисловойНомер;
	Элементы.Автонумерация.Видимость	= ГиперссылкаКакЧисловойНомер ИЛИ ДоговорНеЗакрыт;
	Элементы.Автонумерация.Доступность	= ДоговорНеЗакрыт;
	Элементы.Автонумерация.Подсказка	= "Сгенерировать новый номер по формату ЧЧЧЧЧ/ГГ";
	Элементы.Автонумерация.Гиперссылка	= Истина;
	Элементы.Автонумерация.УстановитьДействие("Нажатие", "Док_НажатиеГиперссылкиАвтонумерации");
	
КонецПроцедуры

#КонецОбласти // Методы_автонумерации

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Док_ДатаОкончаниеВводаТекстаПеред(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ДатаДоИзменения = ДатаДоИзменения(Текст, СтандартнаяОбработка);
	Если СтандартнаяОбработка = Ложь Тогда
		// обработчик этого события ("Док_ДатаОкончаниеВводаТекстаПеред") в платформе 1С по состоянию на релиз 8.3.27.1719
		// до сих пор работает некорректно при отключении стандартной обработки и не всегда отменяет ввод текста в поле формы,
		// по этому приходится делать вот такой "финт ушами",
		// чтобы после этого обработчика была вызвана процедура "Док_ДатаОбработкаВыбораПеред",
		// которая в вопросе отмены выбора значения работает нормально 
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.Добавить(ДатаДоИзменения);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура Док_ДатаОбработкаВыбораПеред(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	
	ДатаДоИзменения = ДатаДоИзменения(ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Функция ДатаДоИзменения(ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Строка") Тогда
		СравниваемаяДата = СтроковыеФункцииКлиентСервер.СтрокаВДату(ВыбранноеЗначение);
	Иначе
		СравниваемаяДата = ВыбранноеЗначение;
	КонецЕсли;
	
	ДатаВОбъекте = Объект.Дата;
	Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыДоговоровКонтрагентов.Закрыт")
		И Объект.ЧисловойНомер > 0
		И СравниваемаяДата <> ДатаВОбъекте Тогда
		ПредупреждениеАсинх("Внимание, изменена дата закрытого договора! "+Символы.ПС+"Новый номер не будет сгенерирован!");
		СтандартнаяОбработка = Ложь;
		// возвращаем значение до изменения
		Если ТипЗнч(ВыбранноеЗначение) = Тип("Строка") Тогда
			ВыбранноеЗначение = Формат(ДатаВОбъекте, "ДЛФ=Д");
		Иначе
			ВыбранноеЗначение = ДатаВОбъекте;
		КонецЕсли;
		// и всё же можно обмануть код, если вернуть статус договора из закрытого в другой, сгенерировать новый номер,
		// а затем снова поменять статус на закрыт, но эту логику, на мой взгляд, нужно контролировать вне рамок задачи автонумерации,
		// потому что вывод договора из состояния закрыт означает также изменение любых других реквизитов договора,
		// которые не контролируются в рамках задачи автонумерации
	КонецЕсли;
	
	Возврат ДатаВОбъекте;
		
КонецФункции

&НаКлиенте
Процедура Док_ДатаПриИзмененииПосле(Элемент)
	
	Если Год(ДатаДоИзменения) <> Год(Объект.Дата)
		 И Объект.ЧисловойНомер > 0
		 И Объект.Статус <> ПредопределенноеЗначение("Перечисление.СтатусыДоговоровКонтрагентов.Закрыт") Тогда
		НомерЧислом = 0;
		ТекстПредупреждения = ПолучитьНовыйНомер(НомерЧислом);
		Если Не ПустаяСтрока(ТекстПредупреждения) Тогда
			ПредупреждениеАсинх(ТекстПредупреждения);
		КонецЕсли;

		ПослеВводаНомера(НомерЧислом);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Док_НажатиеГиперссылкиАвтонумерации(Элемент, СтандартнаяОбработка)
	
	// задам вопрос о том что делать
	СтандартнаяОбработка = Ложь;
	
	Если Объект.ЧисловойНомер > 0 Тогда
		// предложим выбор, генераци\я или очистка номер
		ТекстВопроса = СтрШаблон("Текущий числовой номер документа ""%1"".%2Выберите варианты действий.", Объект.ЧисловойНомер, Символы.ПС);
		ВариантыДляВыбора = Новый СписокЗначений();
		ВариантыДляВыбора.Добавить("очистить", "Очистить текущий номер");
		ВариантыДляВыбора.Добавить("сгенерировать", "Сгенерировать новый номер по формату ЧЧЧЧЧ/ГГ");
		ВариантыДляВыбора.Добавить("отменить", "Отменить");

		ПроцедураЗавершения = Новый ОписаниеОповещения("ПослеВыбораВариантаНумерации", ЭтотОбъект);
		ПоказатьВопрос(ПроцедураЗавершения, ТекстВопроса, ВариантыДляВыбора, 30, "отменить", , "отменить"); 
	Иначе // переходим сразу к генерации нового номера
		ПослеВыбораВариантаНумерации("сгенерировать", Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораВариантаНумерации(Результат, Параметры) Экспорт
	
	Если Результат = "сгенерировать" Тогда
		НомерЧислом = 0;
		ТекстПредупреждения = ПолучитьНовыйНомер(НомерЧислом);
		Если Не ПустаяСтрока(ТекстПредупреждения) Тогда
			ПредупреждениеАсинх(ТекстПредупреждения);
			Возврат;
		КонецЕсли;

		ПроцедураЗавершения = Новый ОписаниеОповещения("ПослеВводаНомера", ЭтотОбъект);
		ПоказатьВводЧисла(ПроцедураЗавершения, НомерЧислом, "Новый числовой номер договора будет:", 5, 0);
	ИначеЕсли Результат = "очистить" Тогда
		ПослеВводаНомера(0);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаНомера(ВведеноеЧисло, ДопПараметры = Неопределено) Экспорт
	
	Если ВведеноеЧисло = Неопределено Тогда // пользователь отказался от ввода
		Возврат;
	КонецЕсли;
	
	УстановитьНомер(ВведеноеЧисло);
	УстановитьВидимостьАвтонумерации();
	
КонецПроцедуры

&НаКлиенте
Процедура Док_СтатусПриИзмененииПосле(Элемент)
	
	Если Элемент.ВыделенныйТекст = "Закрыт" Тогда
		
		Объект.ОграничиватьСуммуЗадолженности = Ложь;
		Объект.ДопустимаяСуммаЗадолженности = 0;
		Объект.ЗапрещаетсяПросроченнаяЗадолженность = Ложь;		
		Объект.КоличествоДнейПросрочки = 0;				
		Объект.РазрешитьОтгрузкуПриПревышении = Ложь;
		
	КонецЕсли;
	
	УстановитьВидимостьАвтонумерации();
	
КонецПроцедуры

&После ("ОрганизацияПриИзмененииСервер")
&НаСервере
Процедура Док_ОрганизацияПриИзмененииСервер()
		Объект.СтавкаНДС=УчетНДСУП.СтавкаНДСПоУмолчанию(Объект.Организация);
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовШапкиФормы

#Область ОбработчикиСобытийФормы

&Перед("ПриСозданииНаСервере")
&НаСервере
Процедура Док_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)

	// Автонумерация +++
	СоздатьЭлементИРеквизитФормы("Автонумерация", , "ГруппаНомерДата", "Дата");
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Дата = ТекущаяДатаСеанса();
		НомерЧислом = 0;
		ПолучитьНовыйНомер(НомерЧислом);
		УстановитьНомер(НомерЧислом, Ложь);
	КонецЕсли;
	УстановитьВидимостьАвтонумерации();
	// Автонумерация ---
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов;
		//	    УстановитьДоступностьЭлементовПоСтатусуСервер();
		Объект.СтатьяДвиженияДенежныхСредств =?(Объект.ТипДоговора=Перечисления.ТипыДоговоров.СПокупателем или Объект.ТипДоговора=Перечисления.ТипыДоговоров.СКомитентом ,Справочники.СтатьиДвиженияДенежныхСредств.ПоступлениеОплатыОтКлиента,Справочники.СтатьиДвиженияДенежныхСредств.ОплатаПоставщику);
	    ЗаполнитьВариантПриемкиТоваровДляЗакупки();
	КонецЕсли;
	Доступ = Пользователи.РолиДоступны("ИзменениеОсновногоМенеджераПартнера");
	Элементы.РазрешитьОтгрузкуПриПревышении1.Доступность		= Доступ;
	Элементы.КоличествоДнейПросрочки1.Доступность				= Доступ;
	Элементы.ОграничиватьСуммуЗадолженности.Доступность			= Доступ;
	Элементы.ДопустимаяСуммаЗадолженности.Доступность			= Доступ;
	Элементы.ЗапрещаетсяПросроченнаяЗадолженность.Доступность	= Доступ;
	
	ЗаполнитьДанныеЛимитаДоговора();

КонецПроцедуры

&НаСервере
Процедура СоздатьЭлементИРеквизитФормы(ИмяЭлемента, ИмяТипаЭлемента = "ДекорацияФормы", ИмяРодителяЭлемента, ИмяМестаРасположенияЭлемента, СоздатьРеквизит = Ложь)
	
	// найду элементы формы для позиционирования нового элемента
	НовыйЭлемент = Элементы.Найти(ИмяЭлемента);
	Если ТипЗнч(НовыйЭлемент) = Тип(ИмяТипаЭлемента) Тогда
		// элемент уже был создан (ПриСозданииНаСервере почемуто запускается два раза при открытии элемента из списка)
		Возврат;
	КонецЕсли;
	
	РодительЭлемента	= Элементы.Найти(ИмяРодителяЭлемента); // было тут - Элементы.ГруппаСтраницы.ПодчиненныеЭлементы.СтраницаОсновное.ПодчиненныеЭлементы.ГруппаШапкаДоговора.ПодчиненныеЭлементы.ГруппаШапкаПраво.ПодчиненныеЭлементы.ГруппаНомерДата
	ЭлементРасположения	= Элементы.Найти(ИмяМестаРасположенияЭлемента);
	ВызватьИсключениеЕслиНеНайден(РодительЭлемента,		ИмяРодителяЭлемента);
	ВызватьИсключениеЕслиНеНайден(ЭлементРасположения,	ИмяМестаРасположенияЭлемента);
	
	// создаю сам элемент
	НовыйЭлемент = Элементы.Добавить(ИмяЭлемента, Тип(ИмяТипаЭлемента), РодительЭлемента);
	
	Элементы.Переместить(НовыйЭлемент, РодительЭлемента, ЭлементРасположения);
	
	Если СоздатьРеквизит Тогда
		ТипСтрока = Новый ОписаниеТипов("Строка");
		Реквизит = Новый РеквизитФормы(ИмяЭлемента, ТипСтрока);
		МасРеквизитов = Новый Массив();
		МасРеквизитов.Добавить(Реквизит);
		ИзменитьРеквизиты(МасРеквизитов);
		НовыйЭлемент.ПутьКДанным = ИмяЭлемента;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВызватьИсключениеЕслиНеНайден(ПроверяемыйЭлемент, ИмяПроверяемогоЭлемента)
	
	Если ПроверяемыйЭлемент = Неопределено Тогда
		ВызватьИсключение "Для размещения нового элемента на форме не найден элемент """ + ИмяПроверяемогоЭлемента + """."
						  + Символы.ПС
						  + "Обратитесь к программистам.";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура Док_ПередЗаписьюНаСервереПеред(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	Если ТекущийОбъект.ЧисловойНомер > 0 Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 1
					   |	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
					   |	ДоговорыКонтрагентов.Дата КАК Дата,
					   |	ДоговорыКонтрагентов.Номер КАК Номер,
					   |	ДоговорыКонтрагентов.Наименование КАК Наименование
					   |ИЗ
					   |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
					   |ГДЕ
					   |	ДоговорыКонтрагентов.ЧисловойНомер = &ЧисловойНомер
					   |	И НАЧАЛОПЕРИОДА(ДоговорыКонтрагентов.Дата, Год) = &ПериодНумерации
					   |	И ДоговорыКонтрагентов.ПометкаУдаления = ЛОЖЬ
					   |	И ДоговорыКонтрагентов.Ссылка <> &СсылкаТекущегоДоговора";
		Запрос = Новый Запрос();
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("ЧисловойНомер", ТекущийОбъект.ЧисловойНомер);
		Запрос.УстановитьПараметр("ПериодНумерации", НачалоГода(ТекущийОбъект.Дата));
		Запрос.УстановитьПараметр("СсылкаТекущегоДоговора", ТекущийОбъект.Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Если Не Отказ Тогда
				Отказ = Истина;
			КонецЕсли;
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = СтрШаблон("Уже есть договор ""%1"" с номером %2 от %3 (сообщение кликабельно)",
										Выборка.Наименование,
										Выборка.Номер,
										Формат(Выборка.Дата, "ДЛФ=Д"));
			Сообщение.Поле = "Номер";
			Сообщение.КлючДанных = Выборка.Ссылка;
			Сообщение.ПутьКДанным = "Объект";
			Сообщение.Сообщить();
			Возврат;
		КонецЕсли;
		
	КонецЕсли;

	Если Не Отказ И ЗначениеЗаполнено(ТекущийОбъект.Ссылка) Тогда
		ТекстЗапроса = "ВЫБРАТЬ
					   |	ДоговорыКонтрагентов.Дата КАК Дата,
					   |	ДоговорыКонтрагентов.ЧисловойНомер КАК ЧисловойНомер
					   |ИЗ
					   |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
					   |ГДЕ
					   |	ДоговорыКонтрагентов.Ссылка = &Ссылка";

		Запрос = Новый Запрос();
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("Ссылка", ТекущийОбъект.Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			СтарыйЧисловойНомер = Выборка.ЧисловойНомер;
			СтараяДата = Выборка.Дата;
		Иначе
			СтарыйЧисловойНомер = 0;
			СтараяДата = Дата('00010101000000');
		КонецЕсли;
	Иначе
		СтарыйЧисловойНомер = 0;
		СтараяДата = Дата('00010101000000');
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура Док_ПриЗаписиНаСервереПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	// Автонумерация +++
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		ПустаяДата			= Дата('00010101000000');
		ПериодНумерации		= НачалоГода(ТекущийОбъект.Дата);
		СохраняемыйНомер	= ТекущийОбъект.ЧисловойНомер;
	
		// необходимо попробовать освободить старый номер, если таковой был
		// это шанс на одну ошибку с автоматическим восстановлением нумерации
		Если СтараяДата <> ПустаяДата И СтарыйЧисловойНомер > 0 Тогда
			ПериодСтаройНумерации = НачалоГода(СтараяДата);
			Если ПериодНумерации <> ПериодСтаройНумерации ИЛИ СохраняемыйНомер = 0 Тогда
				ПоследнийНомер = ПолучитьПоследнийНомер(ПериодСтаройНумерации);
				Если СтарыйЧисловойНомер = ПоследнийНомер Тогда
					ЗаписатьНомер(ПериодСтаройНумерации, СтарыйЧисловойНомер - 1);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		// записываем новый номер
		Если ПериодНумерации <> ПустаяДата И СохраняемыйНомер > 0 Тогда
			НовыйНомер = ПолучитьПоследнийНомер(ПериодНумерации) + 1;
			Если СохраняемыйНомер >= НовыйНомер Тогда
				ЗаписатьНомер(ПериодНумерации, СохраняемыйНомер);
			КонецЕсли;
		КонецЕсли;
	Исключение
		Если Не Отказ Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецПопытки;

	УстановитьПривилегированныйРежим(Ложь);
	
	// Автонумерация ---

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПоследнийНомер(ПериодНумерации)

	Блокировка = Новый БлокировкаДанных();
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.АвтоНумерацияДоговоровКонтрагента");
	ЭлементБлокировки.УстановитьЗначение("ПериодНумерации", ПериодНумерации);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	Блокировка.Заблокировать();
		
	СтруктураИзмерений = Новый Структура();
	СтруктураИзмерений.Вставить("ПериодНумерации", ПериодНумерации);
	ПоследнийНомер = РегистрыСведений.АвтоНумерацияДоговоровКонтрагента.Получить(СтруктураИзмерений).ТекущийНомер;
	Если Не ЗначениеЗаполнено(ПоследнийНомер) Тогда
		ПоследнийНомер = 0;
	КонецЕсли;
	
	Возврат ПоследнийНомер;

КонецФункции

&НаСервереБезКонтекста
Функция ЗаписатьНомер(ПериодНумерации, ЧисловойНомер)

	СтруктураИзмерений = Новый Структура();
	СтруктураИзмерений.Вставить("ПериодНумерации", ПериодНумерации);
	МенеджерЗаписи = РегистрыСведений.АвтоНумерацияДоговоровКонтрагента.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтруктураИзмерений);
	МенеджерЗаписи.ТекущийНомер = ЧисловойНомер;
	МенеджерЗаписи.Записать();
	
КонецФункции

#КонецОбласти // ОбработчикиСобытийФормы

#Область Не_распределённые_методы

&НаСервере
Процедура Док_ОбработкаПроверкиЗаполненияНаСервереПосле(Отказ, ПроверяемыеРеквизиты)
	
	Если Объект.ТипДоговора = ПредопределенноеЗначение("Перечисление.ТипыДоговоров.СПокупателем") И Не ЗначениеЗаполнено(Объект.Ссылка) И Не ЗначениеЗаполнено(Объект.ВидДоговора) Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю("При данном типе взаимоотношений с контрагентом требуется заполнить вид договора!",,"ВидДокумента", "Элементы.ВидДокумента", Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеЛимитаДоговора()

	Макет= РегистрыСведений.ЛимитыДоговоров.ПолучитьМакет("ИнформацияПоДоговору");
	ОбластьЗаголовок=Макет.ПолучитьОбласть("Заголовок");
	ОбластьСтрока=Макет.ПолучитьОбласть("Строка");
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛимитыДоговоров.СуммаЛимита КАК СуммаЛимита,
		|	ЛимитыДоговоров.КоличествоДнейОтсрочки КАК КоличествоДнейПросрочки,
		|	ЛимитыДоговоров.ДатаНачала КАК ДатаНачала,
		|	ЛимитыДоговоров.ДатаОкончания КАК ДатаОкончания,
		|	ЛимитыДоговоров.ВариантВыбора КАК ВариантВыбора
		|ИЗ
		|	РегистрСведений.ЛимитыДоговоров КАК ЛимитыДоговоров
		|ГДЕ
		|	ЛимитыДоговоров.Договор = &Договор";
	
	Запрос.УстановитьПараметр("Договор", Объект.ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	ОбластьЗаголовок.Параметры.ТекстЗаголовка="По условиям договора";
	_ИнформацияПоДоговору.Вывести(ОбластьЗаголовок); 
	Выборка = РезультатЗапроса.Выбрать();
	
	пока Выборка.Следующий() цикл
	ОбластьСтрока.Параметры.ТекстСтроки="Отсрочка "+Выборка.КоличествоДнейПросрочки+" дней";	
	_ИнформацияПоДоговору.Вывести(ОбластьСтрока); 
	ОбластьСтрока.Параметры.ТекстСтроки="Сумма лимита "+Выборка.СуммаЛимита+" р. в период с "+
	Формат(Выборка.ДатаНачала,"ДФ=дд.ММ.гггг")+" по "+Формат(Выборка.ДатаОкончания,"ДФ=дд.ММ.гггг");	
	_ИнформацияПоДоговору.Вывести(ОбластьСтрока); 
	Конеццикла;


КонецПроцедуры

&НаКлиенте
Процедура СтатусДоговораОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	//СтатусДоговораОбработкаВыбораНаСервере();
	если ИспользуетсяЮрОтделом(ВыбранноеЗначение) и ПроверкаРолиЮрОтдела() тогда
		стандартнаяобработка=ложь;
		ПоказатьОповещениеПользователя("Оповещение",, "У вас нет разрешения на этот статус!");
		
		возврат;
		
	конецесли;	
КонецПроцедуры

&НаСервере
функция ИспользуетсяЮрОтделом(Договор)
	
возврат ?(договор<>НЕОПРЕДЕЛЕНО,Договор.ИспользуетсяЮрОтделом,ложь)	
КонецФункции

&НаСервере
функция ПроверкаРолиЮрОтдела()
возврат НЕ Пользователи.РолиДоступны("ДобавлениеИзменениеСтатусовДоговоров")	
КонецФункции

&НаКлиенте
Процедура Спр_ПриОткрытииПосле(Отказ)
	
 ЗаполнитьНаименования(); 
 
 // № 78469
 Если Объект.ТипДоговора = ПредопределенноеЗначение("Перечисление.ТипыДоговоров.СПокупателем") И ЗначениеЗаполнено(Объект.Ссылка) Тогда
	 РазрешенныеРеквизитыДляРедактирования = Новый Массив;
	 РазрешенныеРеквизитыДляРедактирования.Добавить("ВидДоговора");
	 ЗапретРедактированияРеквизитовОбъектовКлиент.УстановитьРазрешенностьРедактированияРеквизитов(ЭтаФорма, РазрешенныеРеквизитыДляРедактирования, Истина);
 КонецЕсли;
 // № 78469
 Если Объект.ТипДоговора = ПредопределенноеЗначение("Перечисление.ТипыДоговоров.СПоставщиком") Тогда
 	ЗаполнитьСтатьяДвиженияДенежныхСредств();
 КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Спр_ТипДоговораПриИзмененииПосле(Элемент)
	ЗаполнитьНаименования();
	ЗаполнитьВариантПриемкиТоваровДляЗакупки();
	
//№ 78469
Если Объект.ТипДоговора = ПредопределенноеЗначение("Перечисление.ТипыДоговоров.СПоставщиком") Тогда
 	ЗаполнитьСтатьяДвиженияДенежныхСредств();
КонецЕсли;	

КонецПроцедуры

&НаСервере
Функция ПолучитьТипДоговора()
    Возврат Перечисления.ТипыДоговоров.Спокупателем;
КонецФункции
 
&НаКлиенте
Процедура ЗаполнитьНаименования()
	Если Объект.ТипДоговора = ПолучитьТипДоговора() И Объект.Ссылка.Пустая() Тогда
		Объект.Наименование = "Договор купли-продажи";
		Объект.НаименованиеДляПечати = "Договор купли-продажи";
	ИначеЕсли Объект.Ссылка.Пустая() Тогда
		Объект.Наименование = "";
		Объект.НаименованиеДляПечати = "";
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВариантПриемкиТоваровДляЗакупки()
	Если Объект.ТипДоговора = ПредопределенноеЗначение("Перечисление.ТипыДоговоров.СПоставщиком") Тогда
		    Объект.ВариантПриемкиТоваров = Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным; 
		    ЗакупкиСервер.ЗаполнитьНастройкиВариантовПриемки(Объект.ВариантПриемкиТоваров, ОформлениеПоступления, ПриемкаТоваров);
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Док_СоздатьЛимитПосле(Команда)
	
	если значениезаполнено(Объект.Ссылка) тогда
		ПараметрыФормы=Новый Структура();
		ПараметрыФормы.Вставить("ЗаполнениеПоДоговору",);
		ПараметрыФормы.Вставить("Договор",Объект.Ссылка);
		ОписаниеОповещенияСозданиеЛимита=Новый ОписаниеОповещения("СозданиеЛимитаДоговораЗавершение",этотОбъект);
		ОткрытьФорму("РегистрСведений.ЛимитыДоговоров.ФормаЗаписи",ПараметрыФормы,ЭтаФорма,,,,ОписаниеОповещенияСозданиеЛимита);
	иначе
		Сообщить("Необходимо записать договор!");
	конецесли;
	
КонецПроцедуры

&НаСервере
Процедура СозданиеЛимитаДоговораЗавершение(Результат, ДополнительныеПараметры)

Элементы._ЛимитыДоговоровСписок.Обновить();	

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтатьяДвиженияДенежныхСредств()
    // № 78469
    МассивГруппыПартнеров = Новый Массив;
    МассивГруппыПартнеров.Добавить(ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Тип поставщика (Поставщики)")); 
    МассивГруппыПартнеров.Добавить(ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Группы партнеров (Общие)"));

    МассивПоставщикТранспортныхУслуг = Новый Массив;
    МассивПоставщикТранспортныхУслуг.Добавить(Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию("Поставщики")); 
    МассивПоставщикТранспортныхУслуг.Добавить(Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию("Поставщик транспортных услуг"));    
	
	Запрос = Новый Запрос;
    ТекстЗапроса = 
    "ВЫБРАТЬ ПЕРВЫЕ 1
    |    ПартнерыДополнительныеРеквизиты.Ссылка
    |ИЗ
    |    Справочник.Партнеры.ДополнительныеРеквизиты КАК ПартнерыДополнительныеРеквизиты
    |ГДЕ
    |    ПартнерыДополнительныеРеквизиты.Ссылка = &Ссылка
    |    И ПартнерыДополнительныеРеквизиты.Свойство В(&ПоставщикиИПоставщикТУСвойство)
    |    И ПартнерыДополнительныеРеквизиты.Значение В(&ПоставщикиИПоставщикТУЗначение)";    
	
    Запрос.Текст = ТекстЗапроса;
    Запрос.УстановитьПараметр("Ссылка", Объект.Партнер);
    Запрос.УстановитьПараметр("ПоставщикиИПоставщикТУСвойство", МассивГруппыПартнеров);
    Запрос.УстановитьПараметр("ПоставщикиИПоставщикТУЗначение", МассивПоставщикТранспортныхУслуг);
		
	ЕстьДополнительныеРеквизиты = Не Запрос.Выполнить().Пустой();
    
   	Если ЕстьДополнительныеРеквизиты И Объект.Партнер.Поставщик = Истина Тогда
   		Если Объект.ТипДоговора = ПредопределенноеЗначение("Перечисление.ТипыДоговоров.СПоставщиком") Тогда	
        
            Статья = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("РАСЧЕТЫ С ПОСТАВЩИКАМИ / Доставка товара");
            // Повторная проверка по коду если было изменено наименование 
            Если Не ЗначениеЗаполнено(Статья) Тогда
                Статья = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду("01-000011");
            КонецЕсли;
        
            Если ЗначениеЗаполнено(Статья) Тогда
                Объект.СтатьяДвиженияДенежныхСредств = Статья;
            Иначе
                Сообщить("Статья 'РАСЧЕТЫ С ПОСТАВЩИКАМИ / Доставка товара' не найдена!");
                Объект.СтатьяДвиженияДенежныхСредств = Неопределено;
            КонецЕсли;        
    	Иначе
        	Объект.СтатьяДвиженияДенежныхСредств = Неопределено;	
    	КонецЕсли; 
	КонецЕсли;   
	
КонецПроцедуры

#КонецОбласти // Не_распределённые
